Revit 2027 API
ConnectorSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Insert(
	Connector item
)
Public Overridable Function Insert (
	item As Connector
) As Boolean
public:
virtual bool Insert(
	Connector^ item
)
abstract Insert :
        item : Connector -> bool
override Insert :
        item : Connector -> bool
Parameters
item Connector
Return Value
Boolean
See Also
Reference
ConnectorSet Class
Autodesk.Revit.DB Namespace